In [1]:
from sqlalchemy import create_engine, text

In [2]:
import pandas as pd

In [3]:
database_name = 'scooters'

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [4]:
connection_string

'postgresql://postgres:postgres@localhost:5432/scooters'

In [5]:
engine = create_engine(connection_string)

In [6]:
query = '''
SELECT *
FROM scooters
LIMIT 100;
'''

with engine.connect() as connection:
    result = connection.execute(text(query))

In [7]:
with engine.connect() as connection:
    scooters_table = pd.read_sql(text(query), con = connection)

scooters_table.head(10)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird
5,2019-05-01 00:01:41.247,36.157188,-86.769978,Powered3F3VK,Powered,82.0,scooter,0.0,Bird
6,2019-05-01 00:01:41.247,36.154348,-86.784765,PoweredVL7YG,Powered,56.0,scooter,0.0,Bird
7,2019-05-01 00:01:41.247,36.158930,-86.775987,Powered5LNUG,Powered,100.0,scooter,0.0,Bird
8,2019-05-01 00:01:41.247,36.135993,-86.804226,Powered7SPQQ,Powered,85.0,scooter,0.0,Bird
9,2019-05-01 00:01:41.247,36.148938,-86.811256,PoweredBV1DT,Powered,65.0,scooter,0.0,Bird

In [8]:
query2 = '''
SELECT *
FROM trips
LIMIT 100;
'''

with engine.connect() as connection:
    result = connection.execute(text(query2))

In [9]:
with engine.connect() as connection:
    trips_table = pd.read_sql(text(query2), con = connection)

trips_table.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [10]:
query3 = '''
select count(*) as total_number_of_null
from scooters
where chargelevel IS NULL 
'''

with engine.connect() as connection:
    result = connection.execute(text(query3))
    
with engine.connect() as connection:
    nulls_within_chargelevel = pd.read_sql(text(query3), con = connection)

nulls_within_chargelevel

   total_number_of_null
0                   770

In [11]:
query4 = '''
select 
	min(pubdatetime) as first_date,
	max(pubdatetime) as last_date
from scooters
'''

with engine.connect() as connection:
    result = connection.execute(text(query4))
    
with engine.connect() as connection:
    daterange_for_pubdatetime = pd.read_sql(text(query4), con = connection)

daterange_for_pubdatetime

               first_date           last_date
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57

In [12]:
scooters_table['pubdatetime'] = pd.to_datetime(scooters_table['pubdatetime'])

In [13]:
scooters_table.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird

In [14]:
trips_table['pubtimestamp'] = pd.to_datetime(trips_table['pubtimestamp'])

In [15]:
trips_table.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [16]:
(trips_table
 .assign(month = trips_table['pubtimestamp'].dt.month_name())
 .month
 .value_counts(sort = False)
)

month
May    100
Name: count, dtype: int64

In [17]:
(scooters_table
 .assign(month = scooters_table['pubdatetime'].dt.month_name())
 .month
 .value_counts(sort = False)
)

month
May    100
Name: count, dtype: int64

In [18]:
trips_grouped = (trips_table
                     .assign(weekday = trips_table['pubtimestamp'].dt.day_name())
                      .query('weekday != "Saturday" and weekday != "Sunday"')   # remove the weekends
                     .groupby(pd.Grouper(key = 'pubtimestamp',
                                         freq = '1h',
                                         origin = 'epoch'
                                        ))
 ['startdate']
 .count()
 .reset_index()       
)

In [19]:
trips_grouped

           pubtimestamp  startdate
0   2019-05-01 00:00:00         92
1   2019-05-01 01:00:00          2
2   2019-05-01 02:00:00          4
3   2019-05-01 03:00:00          0
4   2019-05-01 04:00:00          0
..                  ...        ...
120 2019-05-06 00:00:00          0
121 2019-05-06 01:00:00          0
122 2019-05-06 02:00:00          0
123 2019-05-06 03:00:00          0
124 2019-05-06 04:00:00          1

[125 rows x 2 columns]

In [20]:
triptab = '''
SELECT pubtimestamp, companyname, sumdid, startdate, starttime, enddate, endtime, startlatitude, startlongitude, endlatitude, endlongitude
FROM trips
WHERE tripduration BETWEEN 1 AND 1440;
'''
with engine.connect() as connection:
    trips = pd.read_sql(text(triptab), con = connection)
trips.head()
trips.to_csv('tripsdata.csv', index=False)

In [21]:
trips.head()

,pubtimestamp,companyname,sumdid,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude
0,2019-05-01 00:00:55.423,Bird,Powered9EAJL,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670
1,2019-05-01 00:03:33.147,Lyft,Powered296631,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689
2,2019-05-01 00:05:55.570,Bird,Powered7S2UU,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680
3,2019-05-01 00:05:55.570,Bird,PoweredZIIVX,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960
4,2019-05-01 00:05:55.570,Bird,PoweredJ7MB3,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760

In [22]:
company_names = '''
select companyname as companyname_scooters
from scooters
group by companyname
'''

with engine.connect() as connection:
    result = connection.execute(text(company_names))
    
with engine.connect() as connection:
    company_names = pd.read_sql(text(company_names), con = connection)

company_names   # this query gives us the company names present in the dataset

  companyname_scooters
0                 Bird
1                 Bolt
2               Gotcha
3                 Jump
4                 Lime
5                 Lyft
6                 Spin

In [23]:
number_of_scooters_per_company = '''
SELECT
	companyname, 
	COUNT(distinct sumdid) as number_of_scooters_per_company
FROM scooters
WHERE sumdgroup ilike 'scooter'
GROUP BY companyname
'''

with engine.connect() as connection:
    result = connection.execute(text(number_of_scooters_per_company))
    
with engine.connect() as connection:
    number_of_scooters_per_company = pd.read_sql(text(number_of_scooters_per_company), con = connection)

number_of_scooters_per_company

  companyname  number_of_scooters_per_company
0        Bird                            3860
1        Bolt                             360
2      Gotcha                             224
3        Jump                            1210
4        Lime                            1818
5        Lyft                            1735
6        Spin                             805

In [28]:
# total_scooters = pd.read_csv(r'../DA11/Python/projects/scooters-hawaiian/Corrected_total_scooters.csv')

total_scooters = pd.read_csv('C:/Users/Barbie/Desktop/DA11/Python/projects/scooters-hawaiian/Corrected_total_scooters.csv',
                          on_bad_lines='skip')
#                           nrows = 4495)

In [29]:
total_scooters

,company_name,total_scooter_trips_for_may,total_scooter_trips_for_june,total_scooter_trips_for_july,total_usage
0,Bird,3064,3646,3860,10570
1,Bolt,346,355,360,1061
2,Gotcha,223,223,224,670
3,Jump,976,1037,1210,3223
4,Lime,1631,1762,1818,5211
5,Lyft,1376,1516,1735,4627
6,Spin,687,770,805,2262

In [ ]:
plt.bar(